Repository: jamulussoftware/jamulussoftware.github.io
Catalog: _translator-files/po/*/Choosing-a-Server-Type.po
Languages: fr

source: en
fr: fr

source: Choosing a Server Type
fr: Choisir un type de serveur

source: # Server Types
fr: # Types de Serveurs

source: You can run your server in one of three "modes" (either at home or on a 3rd party host):
fr: Vous pouvez faire fonctionner votre serveur dans l'un des trois "modes" suivants (soit chez vous, soit sur un hôte tiers) :

source: Your server will be listed in the [directory server](Directory-Servers) list that clients use by default. Musicians can then discover and connect to your server. It is not necessary to run as a public server since many other people already run them. Just connect to one with low latency and start jamming.
fr: Votre serveur sera répertorié dans la liste [serveurs annuaire](Directory-Servers) que les clients utilisent par défaut. Les musiciens peuvent alors le découvrir et s'y connecter. Il n'est pas nécessaire de fonctionner en tant que serveur public puisque de nombreuses autres personnes en utilisent déjà. Il suffit de se connecter à un serveur à faible latence et de commencer à jouer.

source: <figure><img src="{{site.url}}/assets/img/en-screenshots/diagram-public-server.png" loading="lazy" alt="Diagram of connections between clients within a Jamulus public server"></figure>
fr: <figure><img src="{{site.url}}/assets/img/fr-screenshots/diagram-public-server.png" loading="lazy" alt="Diagramme des connexions entre clients au sein d'un serveur public Jamulus"></figure>

source: This mode is activated by checking the "Register my server..." checkbox and (optionally) entering your server information.
fr: Ce mode est activé en cochant la case "Rendre mon serveur public..." et en saisissant (facultativement) les informations relatives à votre serveur.

source: When running without the GUI ("headless"), the following would configure a public server:
fr: Lors de l'exécution sans l'interface graphique ("headless"), la procédure suivante configurerait un serveur public :

source: **Note**: It is **not** necessary to port-forward or otherwise configure your router to run a public server.
fr: Il n'est **pas** nécessaire de faire une redirection de port ou de configurer votre routeur pour qu'il exécute un serveur public.

source: See also [Command Line Options](Command-Line-Options) for other parameters you can set.
fr: Voir également [Options de la ligne de commande](Command-Line-Options) pour les autres paramètres que vous pouvez définir.

source: ### 2. Private
fr: ### 2. Privé

source: This type of server will not be listed on a directory server list. You must give musicians your server address to connect their clients to. See [Running a Private Server](Running-a-Private-Server) for what needs to be done to enable others to connect to it.
fr: Ce type de serveur ne sera pas répertorié dans une liste de serveurs. Vous devez donner aux musiciens l'adresse de votre serveur pour qu'ils puissent y connecter leurs clients. Voir [Gestion d'un serveur privé](Running-a-Private-Server) pour savoir ce qu'il faut faire pour permettre aux autres de s'y connecter.

source: <figure><img src="{{site.url}}/assets/img/en-screenshots/diagram-private-server.png" loading="lazy" alt="Diagram of connections between clients within a Jamulus private server"></figure>
fr: <figure><img src="{{site.url}}/assets/img/fr-screenshots/diagram-private-server.png" loading="lazy" alt="Diagramme des connexions entre clients au sein d'un serveur privé Jamulus"></figure>

source: This mode is activated by un-checking "Register my server...".
fr: Ce mode est activé en décochant la case "Rendre mon serveur public...".

source: When running without the GUI ("headless"), the following would configure a private server:
fr: Lorsqu'il est exécuté sans l'interface graphique ("headless"), ce qui suit configurerait un serveur privé :

source: ### 3. Directory
fr: ### 3. Serveur annuaire

source: Configuring your server as a Directory Server need only be done under special circumstances (e.g. for online events or musical associations). Most people can ignore this type.
fr: La configuration de votre serveur en tant que serveur annuaire ne doit être effectuée que dans des circonstances particulières (par exemple, pour des événements en ligne ou des associations musicales). La plupart des gens peuvent ignorer ce type.

source: To view servers listed by a custom directory server, musicians must enter the address in their client’s "Custom Directory Server" settings field. They will then see a Connection Setup list which is generated by that directory server.
fr: Pour afficher les serveurs répertoriés par un serveur d'annuaire personnalisé, les musiciens doivent saisir l'adresse dans le champ de paramètres "Adresse personnalisée du serveur annuaire" de leur client. Ils verront alors une liste de configuration de connexion générée par ce serveur d'annuaire.

source: Normal server operators can also register with your custom directory server so their servers can show up in your server list by setting yours as their `--directoryserver` option.
fr: Les opérateurs de serveurs normaux peuvent également s'inscrire auprès de votre serveur d'annuaire personnalisé afin que leurs serveurs apparaissent dans votre liste de serveurs en définissant le votre comme option `--directoryserver`.

source: To run a server as a Directory Server, it should be configured with `--directoryserver localhost` (that is, specify itself as the directory server to query).
fr: Pour faire fonctionner un serveur en tant que serveur annuaire, il doit être configuré avec `--directoryserver localhost` (c'est-à-dire qu'il doit se spécifier comme le serveur d'annuaire à interroger).

source: #### Configuration points to note
fr: #### Points de configuration à noter

source: If you want to control which servers can register with your Directory Server, you can enable a whitelist with the `--listfilter` command line option. See the [command line options page](Command-Line-Options) for further information about this feature and other parameters you can set.
fr: Si vous voulez contrôler quels serveurs peuvent s'enregistrer grâce à votre serveur annuaire, vous pouvez activer une liste blanche avec l'option de ligne de commande `--listfilter`. Consultez la page [Options de la ligne de commande](Command-Line-Options) pour plus d'informations sur cette fonctionnalité et les autres paramètres que vous pouvez définir.

source: When running a public Directory Server behind a NAT firewall on a private network, use the `--serverpublicip` option to specify the public IP address of the server(s) being listed by your Directory Server. This is necessary to allow clients on the public Internet to connect to them via NAT. Note that for the servers using this option, you will still need proper port forwarding in your router/firewall.
fr: Lorsque vous exécutez un serveur annuaire public derrière un pare-feu NAT sur un réseau privé, utilisez l'option `--serverpublicip` pour spécifier l'adresse IP publique du ou des serveurs listés par votre serveur annuaire. Ceci est nécessaire pour permettre aux clients de l'Internet public de se connecter à eux via NAT. Notez que pour les serveurs utilisant cette option, vous aurez toujours besoin d'une redirection de port appropriée dans votre routeur/pare-feu.
