Repository: jamulussoftware/jamulussoftware.github.io
Catalog: _translator-files/po/*/Hardware-Setup.po
Languages: es, fr

source: en
es: es
fr: fr

source: Hardware Setup
es: Configuración de Hardware
fr: Configuration du matériel

source: {% include breadcrumb.html root="Using Jamulus" branch1="Getting Started" branch1-url="Getting-Started" %}
es: {% include breadcrumb.html root="Utilización de Jamulus" branch1="Cómo Empezar" branch1-url="Getting-Started" %}

source: # Hardware Setup
es: # Configuración de Hardware
fr: # Configuration du matériel

source: ## General info
es: ## Información general
fr: ## Informations générales

source: **For Jamulus to run stable it is recommended to use a PC with at least 1.5GHz CPU frequency.**
es: **Para que Jamulus se ejecute con estabilidad se recomienda utilizar un PC con un procesador de al menos 1.5 GHz.**
fr: **Pour que Jamulus fonctionne de manière stable, il est recommandé d'utiliser un PC avec une fréquence CPU d'au moins 1,5 GHz.**

source: **Windows users**: You need to install an ASIO driver. A sound card with a native ASIO driver is recommended. Have a look at the [Windows installation page](Installation-for-Windows) for further information.
es: **Usuarios de Windows**: Necesitarás instalar un driver ASIO. Se recomienda una tarjeta de audio con driver ASIO nativo. Consulta la [página de instalación en Windows](Installation-for-Windows) para más información.
fr: **Utilisateurs de Windows** : Vous devez installer un pilote ASIO. Une carte son avec un pilote ASIO natif est recommandée. Consultez la [page d'installation Windows](Installation-for-Windows) pour plus d'informations.

source: ## Example Setups
es: ## Ejemplos de Configuración
fr: ## Exemples de configuration

source: Setting up hardware usually boils down to 4 points, although each setup is different.
es: Normalmente, configurar el hardware se reduce a 4 puntos, aunque cada equipo es diferente.
fr: La configuration du matériel se résume généralement à 4 points, bien que chaque configuration soit différente.

source: Plug the interface into a USB port on your computer
es: Enchufa el interfaz en un puerto USB de tu ordenador
fr: Branchez l'interface sur un port USB de votre ordinateur.

source: Close all programs and start Jamulus (don't forget to choose the right inputs in Jamulus's settings)
es: Cierra todos los programas y arranca Jamulus (no olvides escoger las entradas correctas en la configuración de Jamulus)
fr: Fermez tous les programmes et démarrez Jamulus (n'oubliez pas de choisir les bonnes entrées dans les paramètres de Jamulus).

source: Plug in your instrument/microphone and headphones
es: Enchufa tu instrumento/micrófono y tus auriculares
fr: Branchez votre instrument/microphone et vos écouteurs.

source: Connect to a Jamulus server and have fun!
es: Conéctate a un servidor Jamulus y ¡a divertirse!
fr: Connectez-vous à un serveur Jamulus et amusez-vous !

source: ## Windows: Audio interface connection - ASIO4ALL
es: ## Windows: Conexión interfaz de audio - ASIO4ALL
fr: ## Windows : Connexion d'une interface audio - ASIO4ALL

source: This is an example Windows client installation with the [Behringer U-CONTROL UCA202](https://www.amazon.com/Behringer-U-Phono-UFO202-Audiophile-Interface/dp/B002GHBYZ0) audio device. The following instructions might be similar with other audio devices.
es: Este es un ejemplo de instalación de un cliente en Windows con un dispositivo de audio [Behringer U-CONTROL UCA202](https://www.amazon.com/Behringer-U-Phono-UFO202-Audiophile-Interface/dp/B002GHBYZ0). Las siguientes instrucciones pueden ser similares para otros dispositivos de audio.
fr: Voici un exemple d'installation client Windows avec le périphérique audio [Behringer U-CONTROL UCA202](https://www.amazon.com/Behringer-U-Phono-UFO202-Audiophile-Interface/dp/B002GHBYZ0). Les instructions suivantes peuvent être similaires avec d'autres périphériques audio.

source: _**The exact method of connecting your instrument will of course vary depending on your hardware.**_
es: _**El modo exacto de conectar tu instrumento variará dependiendo de tu hardware.**_
fr: _**La méthode exacte de connexion de votre instrument variera bien sûr en fonction de votre matériel.**_

source: #### 1. Plug the interface into a USB port on your computer
es: #### 1. Enchufa el interfaz en un puerto USB de tu ordenador
fr: #### 1. Branchez l'interface sur un port USB de votre ordinateur.

source: In future, always use the same USB port for the audio device.
es: En el futuro, siempre utiliza el mismo puerto USB para el dispositivo de audio.
fr: A l'avenir, utilisez toujours le même port USB pour le périphérique audio.

source: **Windows users**: If not already done: download and install the [free ASIO sound driver (ASIO4ALL)](https://www.asio4all.org){: target="_blank" rel="noopener noreferrer"}. Some people have also reported success using [this ASIO native driver](http://www.behringerdownload.de/_software/BEHRINGER_2902_X64_2.8.40.zip){: target="_blank" rel="noopener noreferrer"} __currently not available__, although it's not listed on Behringer's product pages as of April 2020.
es: **Usuarios de Windows**: Si no lo has hecho ya: descarga e instala [el driver ASIO de audio gratuito (ASIO4ALL](https://www.asio4all.org){: target="_blank" rel="noopener noreferrer"}. Algunas personas han tenido éxito utilizando [este driver ASIO nativo](http://www.behringerdownload.de/_software/BEHRINGER_2902_X64_2.8.40.zip){: target="_blank" rel="noopener noreferrer"} __actualmente no disponible__; no está listado en las páginas de producto de Behringer a fecha de abril del 2020.
fr: **Utilisateurs de Windows** : Si ce n'est pas déjà fait, téléchargez et installez le [pilote audio ASIO gratuit (ASIO4ALL)] (https://www.asio4all.org) { : target="_blank" rel="noopener noreferrer"}. Certaines personnes ont également déclaré avoir réussi à utiliser [ce pilote natif ASIO](http://www.behringerdownload.de/_software/BEHRINGER_2902_X64_2.8.40.zip){ : target="_blank" rel="noopener noreferrer"}. __actuellement non disponible__, bien qu'il ne figure pas sur les pages produits de Behringer en avril 2020.

source: #### 2. Start Jamulus
es: #### 2. Arranca Jamulus
fr: #### 2. Démarrez Jamulus

source: Configure Jamulus to use the correct sound setup (see [this excellent guide](https://www.facebook.com/notes/jamulus-online-musicianssingers-jamming/idiots-guide-to-jamulus-app/510044532903831/) by [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) on Facebook).
es: Configura Jamulus para utilizar la configuración de audio correcta (ver [esta excelente guía](https://www.facebook.com/notes/jamulus-online-musicianssingers-jamming/idiots-guide-to-jamulus-app/510044532903831/) de [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) en Facebook).
fr: Configurez Jamulus pour utiliser la bonne configuration sonore (voir [cet excellent guide](https://www.facebook.com/notes/jamulus-online-musicianssingers-jamming/idiots-guide-to-jamulus-app/510044532903831/) par [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) sur Facebook).

source: Make sure you have switched off the monitor button on your Behringer U-CONTROL UCA202 (otherwise you will hear both the original sound you are sending to the Jamulus server as well as the returning sound, and may get feedback).
es: Asegúrate de haber apagado el botón de monitoreo en tu Behringer U-CONTROL UCA202 (de lo contrario escucharás tanto el sonido original que envías al servidor Jamulus como el sonido que vuelve del mismo, y podría causar retroalimentación).
fr: Assurez-vous que vous avez désactivé le bouton de contrôle de votre Behringer U-CONTROL UCA202 (sinon vous entendrez à la fois le son original que vous envoyez au serveur Jamulus et le son renvoyé, et vous risquez d'avoir un retour).

source: #### 3. Plug in your instrument and headphones
es: #### 3. Enchufa tu instrumento y tus auriculares
fr: #### 3. Branchez votre instrument et vos écouteurs

source: Connect your instrument to the input socket of the Behringer U-CONTROL UCA202. Plug your headphones into the Behringer U-CONTROL UCA202.
es: Conecta tu instrumento a una entrada del Behringer U-CONTROL UCA202. Enchufa tus auriculares al Behringer U-CONTROL UCA202.
fr: Connectez votre instrument à la prise d'entrée du Behringer U-CONTROL UCA202. Branchez votre casque dans le Behringer U-CONTROL UCA202.

source: #### 4. Connect to a Jamulus server.
es: #### 4. Conéctate a un servidor Jamulus.
fr: #### 4. Connectez-vous à un serveur Jamulus.

source: You're done! Have fun!
es: ¡Ya está! ¡Diviértete!
fr: Vous avez terminé ! Amusez-vous bien !

source: ## Linux: Audio interface connection with QjackCtl
es: ## Linux: Conexión de interfaz de audio con QjackCtl
fr: ## Linux : Connexion d'une interface audio avec QjackCtl

source: Refer to the Linux [client install guide](Installation-for-Linux#configure-jack-with-qjackctl).
es: Consulta la [guía de instalación del cliente](Installation-for-Linux#configura-jack-con-qjackctl) en Linux.
fr: Consultez le [guide d'installation du client] Linux (Installation-for-Linux#configure-jack-with-qjackctl).

source: ## Linux: Low Latency Kernels for Jamulus
es: ## Linux: Kernels Low Latency para Jamulus
fr: ## Linux : Noyaux à faible latence pour Jamulus

source: You might want to install [Ubuntu Studio](https://ubuntustudio.org/). It adds a second option in your boot menu for a low-latency kernel. The key to successful jamming is "low latency" between servers and connected Jamulus clients. If the underlying Linux system is started with a low-latency kernel then it has a positive impact on latency for your Jamulus sessions.
es: Quizá quieras instalar [Ubuntu Studio](https://ubuntustudio.org/). Añade otra opción en el menú de arranque para un kernel de baja latencia. La clave para una jam session online es la baja latencia entre los servidores y los clientes conectados. Si el sistema Linux arranca con un kernel de baja latencia esto tendrá un impacto positivo en tus sesiones de Jamulus.
fr: Vous voudrez peut-être installer [Ubuntu Studio] (https://ubuntustudio.org/). Il ajoute une deuxième option dans votre menu de démarrage pour un noyau à faible latence. La clé d'un boeuf réussi est une "faible latence" entre les serveurs et les clients Jamulus connectés. Si le système Linux sous-jacent est démarré avec un noyau à faible latence, cela a un impact positif sur la latence de vos sessions Jamulus.

source: ## Points to note about inputs
es: ## Apuntes sobre las entradas
fr: ## Points à noter concernant les entrées

source: If you want to connect 2 or more sources (e.g. voice + synth + guitar), it is important to note that Jamulus currently handles only 2 input channels (L/R). So the hardware being used must provide a mixed-down stereo output to Jamulus. Alternatively, run two instances of Jamulus, if your hardware supports it, or use virtual audio inputs to Jamulus for each hardware input.
es: Si quieres conectar 2 o más fuentes de audio (por ej. voz + sinte + guitarra), es importante tener en cuenta que actualmente Jamulus solo acepta 2 canales de entrada (L/R). Por lo tanto, el hardware utilizado debe proporcionar una salida mezclada a estéreo a Jamulus. Como alternativa, ejecuta dos instancias de Jamulus si tu hardware lo permite, o utiliza entradas virtuales de audio a Jamulus para cada entrada de hardware.
fr: Si vous souhaitez connecter 2 sources ou plus (par exemple, voix + synthétiseur + guitare), il est important de noter que Jamulus ne gère actuellement que 2 canaux d'entrée (G/D). Le matériel utilisé doit donc fournir une sortie stéréo mixée à Jamulus. Vous pouvez également exécuter deux instances de Jamulus, si votre matériel le permet, ou utiliser des entrées audio virtuelles vers Jamulus pour chaque entrée matérielle.

source: Audio interfaces generally output a mixed signal on their analogue output, but separate signals (1 per source) on their digital output (USB/FireWire/Thunderbolt).
es: Generalmente los dispositivos de audio producen una señal mezclada en su salida analógica, pero señales separadas (1 por fuente) en su salida digital (USB/FireWire/Thunderbolt).
fr: Les interfaces audio produisent généralement un signal mixte sur leur sortie analogique, mais des signaux séparés (1 par source) sur leur sortie numérique (USB/FireWire/Thunderbolt).

source: Mixers generally only output mixed-down signals on their analogue output.
es: Generalmente las mesas de mezclas solo producen señales mezcladas en su salida analógica.
fr: Les mixeurs ne produisent généralement que des signaux mixés sur leur sortie analogique.

source: Mixers with USB/FireWire/Thunderbolt generally output a mixed-down signal on their **analogue** output AND separate signals only (no mixed-down signal) on their **digital** output.
es: Generalmente las mesas de mezclas con USB/FireWire/Thunderbolt producen señales mezcladas en su salida **analógica** Y TAMBIÉN señales separadas solo (no una señal mezclada) en su salida **digital**.
fr: Les mixeurs avec USB/FireWire/Thunderbolt émettent généralement un signal mixé vers le bas sur leur sortie **analogique** ET des signaux séparés uniquement (pas de signal mixé vers le bas) sur leur sortie **numérique**.

source: A few Mixers with USB/FireWire/Thunderbolt will either send **only** a mixed-down signal to the **digital** output (small/budget mixers), or else also ADD a stereo mixed-down signal to the separate signals on the digital output.
es: Algunas mesas de mezclas con USB/FireWire/Thunderbolt enviarán **solo** una señal mezclada a la salida **digital** (mesas pequeñas/económicas), o si no también AÑADEN una señal mezclada a las señales separadas de la salida digital.
fr: Quelques mixeurs avec USB/FireWire/Thunderbolt enverront **seulement** un signal mixé vers le bas sur la sortie **numérique** (mixeurs à petit budget), ou bien ajouteront également un signal stéréo mixé vers le bas aux signaux séparés sur la sortie numérique.

source: _(Thanks to [pcar75](https://github.com/pcar75) for this information)_
es: _(Gracias a [pcar75](https://github.com/pcar75) por esta información)_
fr: (Merci à [pcar75](https://github.com/pcar75) pour cette information).

source: ## Other examples
es: ## Otros ejemplos
fr: ## Autres exemples

source: **This video documents a [live jam session](https://youtu.be/c8838jS2g3U).** I am using a Lexicon Omega USB audio card on a 2009 Mac Mini. My bandmates all use Windows 10 and have Behringer audio cards, e.g. the Behringer Xenyx 1204USB. My internet connection is 10 Mbit/s down / 1 Mbit/s upstream via DSL.
es: **Este vídeo documenta una [sesión jam en directo](https://youtu.be/c8838jS2g3U).** Utilizo una tarjeta de audio USB Lexicon Omega en un Mac Mini del 2009. Mis compañeros de grupo utilizan todos Windows 10 y tienen tarjetas de audio Behringer, por ejemplo el Behringer Xenyx 1204USB. Mi conexión a internet tiene 10 Mbit/s de bajada / 1 Mbit/s de subida mediante conexión DSL.
fr: **Cette vidéo documente une [live jam session](https://youtu.be/c8838jS2g3U).** J'utilise une carte audio USB Lexicon Omega sur un Mac Mini 2009. Mes collègues utilisent tous Windows 10 et ont des cartes audio Behringer, par exemple la Behringer Xenyx 1204USB. Ma connexion Internet est de 10 Mbit/s en aval / 1 Mbit/s en amont via DSL.

source: **Jamulus user [Andrew Evans](https://sourceforge.net/u/belvario/profile/)**: With bandmates all within one city (but spanning 2 ISPs) and achieving a consistent 20 ms ping time, running the server on a separate dedicated Windows machine and a client on a MacBook Pro. Remote players on MacBook Air. Everyone on wired Ethernet connections to their home router/gateways. We used WhatsApp video to see each other (with audio muted - it's funny to see how far behind the WhatsApp audio lags from Jamulus though!)
es: **El usuario de Jamulus [Andrew Evans](https://sourceforge.net/u/belvario/profile/)**: Con todos los compañeros de grupo en la misma ciudad (pero con 2 ISPs diferentes) y un tiempo ping de 20 ms estables, ejecutando el servidor en un ordenador Windows por separado y el cliente en un Macbook Pro. Los demás músicos con MacBook Air. Todos con conexión Ethernet por cable a sus routers/gateways. Utilizamos WhatsApp video para vernos (con el audio apagado - ¡pero es divertido ver lo atrás que queda el audio de Whatsapp con respecto a Jamulus!)
fr: **Utilisateur de Jamulus [Andrew Evans] (https://sourceforge.net/u/belvario/profile/)** : Avec des membres du groupe tous situés dans la même ville (mais couvrant 2 FAI) et obtenant un temps de ping constant de 20 ms, en faisant tourner le serveur sur une machine Windows dédiée séparée et un client sur un MacBook Pro. Les joueurs distants sur MacBook Air. Tout le monde sur des connexions Ethernet filaires à leur routeur/ passerelle domestique. Nous avons utilisé la vidéo WhatsApp pour nous voir (avec le son coupé - c'est amusant de voir à quel point l'audio de WhatsApp est en retard sur Jamulus !)

source: ## Having problems?
es: ## ¿Tienes problemas?
fr: ## Vous avez des problèmes ?

source: Please see the [Client Troubleshooting FAQ](Client-Troubleshooting)
es: Consulta el [FAQ de Resolución de Problemas con el Cliente](Client-Troubleshooting)
fr: Veuillez consulter la [FAQ sur le dépannage du client] (Client-Troubleshooting).
