Repository: jamulussoftware/jamulussoftware.github.io
Catalog: _translator-files/po/*/Network-Requirements.po
Languages: fr

source: en
fr: fr

source: Quality, Delay and Bandwidth
fr: Qualité, délai et bande passante

source: # Network Requirements
fr: # Configuration réseau

source: ## Audio bandwidth
fr: ## Bande passante audio

source: The audio settings have an impact on the required network bandwidth. The table below summarises network requirements with respect to the configuration of:
fr: Les paramètres audio ont un impact sur la bande passante réseau requise. Le tableau ci-dessous résume les exigences du réseau en fonction de la configuration de :

source: Channels : stereo/mono
fr: Canaux : stéréo/mono

source: Quality : high/medium/low
fr: Qualité : haute/moyenne/basse

source: Audio buffer duration : 2.67 ms, 5.33 ms, 10.67 ms, 21.33 ms
fr: Durée du tampon audio : 2,67 ms, 5,33 ms, 10,67 ms, 21,33 ms.

source: With the following units
fr: Avec les unités suivantes

source: ms : milliseconds
fr: ms : millisecondes

source: Kbit/s : Kilo-bits per second (Reminder : 1 Mbit/s = 1024 Kbit/s, 1 KByte/s = 8 Kbit/s)
fr: Kbit/s : Kilo-bits par seconde (Rappel : 1 Mbit/s = 1024 Kbit/s, 1 KByte/s = 8 Kbit/s)

source: Mbit/s : Mega-bits per second
fr: Mbit/s : Méga-bits par seconde

source: | Channels | Quality | Bandwidth (for buffer : 2.67 ms) | Bandwidth (for buffer : 5.33 ms) | Bandwidth (for buffer : 10.67 ms) | Bandwidth (for buffer : 21.33 ms) | | --------- | ------ | -------- | -------- | -------- | -------- | | Stereo | High | 894 Kbit/s | 657 Kbit/s | 541 Kbit/s | 483 Kbit/s | | Stereo | Medium | 672 Kbit/s | 444 Kbit/s | 328 Kbit/s | 270 Kbit/s | | Stereo | Low | 606 Kbit/s | 372 Kbit/s | 256 Kbit/s | 198 Kbit/s | | Mono | High | 672 Kbit/s | 444 Kbit/s | 328 Kbit/s | 270 Kbit/s | | Mono | Medium | 594 Kbit/s | 366 Kbit/s | 250 Kbit/s | 192 Kbit/s | | Mono | Low | 534 Kbit/s | 306 Kbit/s | 190 Kbit/s | 132 Kbit/s |
fr: | Canaux | Qualité | Bande passante (pour le tampon : 2,67 ms) | Bande passante (pour le tampon : 5,33 ms) | Bande passante (pour le tampon : 10,67 ms) | Bande passante (pour le tampon : 21,33 ms) | | --------- | ------ | -------- | -------- | -------- | -------- | | Stéréo haute qualité : 894 Kbit/s, 657 Kbit/s, 541 Kbit/s, 483 Kbit/s. | Stéréo | Moyen | 672 Kbit/s | 444 Kbit/s | 328 Kbit/s | 270 Kbit/s | Stéréo | Faible | 606 Kbit/s | 444 Kbit/s | 541 Kbit/s | 483 Kbit/s | Stéréo basse : 606 Kbit/s, 372 Kbit/s, 256 Kbit/s et 198 Kbit/s. | Mono | Haut | 672 Kbit/s | 444 Kbit/s | 328 Kbit/s | 270 Kbit/s | Mono | Moyen | 594 Kbit/s | 328 Kbit/s | 328 Kbit/s | 270 Kbit/s | Mono | Moyen | 594 Kbit/s | 366 Kbit/s | 250 Kbit/s | 192 Kbit/s | Mono | Bas | 534 Kbit/s | 256 Kbit/s | 198 Kbit/s | 0,5 %. | Mono | Faible | 534 Kbit/s | 306 Kbit/s | 190 Kbit/s | 132 Kbit/s | | Mono | Moyenne | 594 Kbit/s | 366 Kbit/s | 250 Kbit/s | 192 Kbit/s

source: ## Network bandwidth
fr: ## Largeur de bande du réseau

source: There is one upstream (musician sending to the server) and one downstream (server sending back the mix to the musician) <figure><img src="{{site.url}}/assets/img/en-screenshots/bandwidth-diagram.png" loading="lazy" alt="A diagram of Jamulus network bandwidths from different audio qualities ranging from low to high"></figure>
fr: Il y a un amont (musicien envoyant au serveur) et un aval (serveur renvoyant le mixage au musicien). <figure><img src="{{site.url}}/assets/img/fr-screenshots/bandwidth-diagram.png" loading="lazy" alt="Un diagramme de la bande passante du réseau Jamulus à partir de différentes qualités audio allant de faible à élevée"></figure>

source: Note also that mean ADSL2 transfer rate is 10 Mbit/s for downstream and 1 Mbit/s for upstream. The actual performance depends on distance to the provider, which may [theoretically range from 24 Mbit/s at 0.3 km to 1.5 Mbit/s at 5.2 km](https://en.wikipedia.org/wiki/Asymmetric_digital_subscriber_line) for download rate.
fr: Notez également que le débit moyen de l'ADSL2 est de 10 Mbit/s en aval et de 1 Mbit/s en amont. Les performances réelles dépendent de la distance au fournisseur, qui peut [théoriquement aller de 24 Mbit/s à 0,3 km à 1,5 Mbit/s à 5,2 km](https://en.wikipedia.org/wiki/Asymmetric_digital_subscriber_line) pour le débit descendant.
