Repository: jamulussoftware/jamulussoftware.github.io
Catalog: _translator-files/po/*/Running-a-Private-Server.po
Languages: es, fr

source: en
es: es
fr: fr

source: Running a Private Server
es: Ejecutar un Servidor Privado
fr: Exécuter d'un serveur privé

source: {% include breadcrumb.html root="Using Jamulus" branch1="Running a Server" branch1-url="Running-a-Server" %}
es: {% include breadcrumb.html root="Más" branch1="Ejecutar un Servidor" branch1-url="Running-a-Server" %}
fr: {% include breadcrumb.html root="More" branch1="Running a Server" branch1-url="Running-a-Server" %}

source: # Running a Private Server
es: # Ejecutar un Servidor Privado
fr: # Exécuter d'un serveur privé

source: **_Please ensure you have read the [server overview](Running-a-Server)_**
es: **_Primero asegúrate de leer la [descripción de servidores](Running-a-Server)_**
fr: **_Veuillez vous assurer que vous avez lu la page [Exécuter un serveur](Running-a-Server)_**

source: This guide assumes you will be running a private server on your home network, but some of the issues here may also apply to those running on cloud hosts (e.g. Amazon EC2).
es: Esta guía presupone que vas a ejecutar un servidor privado en tu red doméstica, pero algunos de los problemas de aquí también podrían ser aplicables a aquellos ejecutándolo en hosts en la nube (por ej. Amazon EC2).
fr: Ce guide part du principe que vous allez exécuter un serveur privé sur votre réseau domestique, mais certains des problèmes abordés ici peuvent également s'appliquer à ceux qui fonctionnent sur des hôtes en nuage (par exemple Amazon EC2).

source: It is highly recommended to test your server in **public mode first** so as to narrow down any subsequent problems in private mode.
es: Se recomienda que pruebes a ejecutar tu servidor en **modo público primero** para así acotar cualquier problema posterior en modo privado.
fr: Il est fortement recommandé de tester d'abord votre serveur en **mode public** afin de limiter les problèmes ultérieurs en mode privé.

source: ## Operating a private server behind a home network router
es: ## Operar un servidor privado tras un router doméstico
fr: ## Exploitation d'un serveur privé derrière un routeur de réseau domestique

source: ### Port forwarding
es: ### Redireccionamiento de puertos
fr: ### Redirection de port

source: To run a private server, you need to set up port forwarding on your router. _(If you are curious about why you need to do this for private but not public servers, see [this footnote](#footnote-for-geeks).)_
es: Para operar un servidor privado, necesitas habilitar el redireccionamiento de puertos en tu router. _(Si tienes curiosidad sobre por qué hay que hacer esto para los servidores privados pero no para los públicos, consulta [esta nota](#nota-para-frikis).)_
fr: Pour faire fonctionner un serveur privé, vous devez configurer la redirection de port sur votre routeur. _(Si vous êtes curieux de savoir pourquoi vous devez faire cela pour les serveurs privés mais pas pour les serveurs publics, consultez [cette note de bas de page](#Note-de-bas-de-page-pour-les-geeks).)_

source: Normally, people from outside your home network cannot see things inside it. So if you want to operate a Jamulus server at home, you need to open a hole in your router to let Jamulus clients connect to it.
es: Normalmente, las personas de fuera de tu red doméstica no pueden ver lo que sucede dentro de ella. Por tanto, si quieres operar un servidor Jamulus en casa, tienes que abrir una puerta en tu router para dejar que clientes de Jamulus puedan conectarse a él.
fr: Normalement, les personnes extérieures à votre réseau domestique ne peuvent pas voir ce qui s'y trouve. Ainsi, si vous souhaitez faire fonctionner un serveur Jamulus chez vous, vous devez ouvrir une brèche dans votre routeur pour permettre aux clients Jamulus de s'y connecter.

source: **The default port for the current version of Jamulus is UDP (not TCP) port 22124.**
es: **El puerto por defecto para la versión actual de Jamulus es el puerto UDP (no TCP) 22124.**
fr: **Le port par défaut de la version actuelle de Jamulus est le port UDP (et non TCP) 22124.**

source: The exact setup of port forwarding differs for every router. Here's an example of the port forwarding settings in a Linksys router:
es: La configuración exacta del redireccionamiento de puertos difiere para cada router. Aquí hay un ejemplo de esta configuración en un router Linksys:
fr: La configuration exacte de la redirection de port diffère pour chaque routeur. Voici un exemple des paramètres de la redirection de port dans un routeur Linksys :

source: <figure><img src="{{site.url}}/assets/img/en-screenshots/linksys-port-forward.png" loading="lazy" alt="Image of a Linksys router's port forwarding settings"></figure>
es: <figure><img src="{{site.url}}/assets/img/es-screenshots/linksys-port-forward.png" loading="lazy" alt="Imagen de la configuración de redireccionamiento de puertos de un router Linksys"></figure>
fr: <figure><img src="{{site.url}}/assets/img/en-screenshots/linksys-port-forward.png" loading="lazy" alt="Image des paramètres de redirection de port d'un routeur Linksys"></figure>

source: For help see [portforward.com](https://portforward.com).
es: Para más ayuda ver [portforward.com](https://portforward.com).
fr: Pour obtenir de l'aide, consultez [portforward.com](https://portforward.com).

source: Once you have your router set up, you can get your external (WAN) IP address e.g. by [using Google](https://www.google.com/search?q=what+is+my+ip). Give this address to your friends so they can connect to your server (_but see also the note on dynamic DNS below_). You yourself have to connect to your own computer instead, since your computer runs the server. Therefore **only you** need to connect to `127.0.0.1`.
es: Una vez configurado el router, puedes obtener tu dirección IP (WAN) externa por ejemplo [usando Google](https://www.google.com/search?q=what+is+my+ip). Dales esta dirección a tus amig@s para que puedan conectarse a tu servidor (_pero también lee la nota sobre DNS dinámica abajo_). Tú tienes que conectarte a tu propio ordenador, puesto que tu ordenador es el que ejecuta el servidor. Por tanto, **solo tú** tienes que conectarte a `127.0.0.1`.
fr: Une fois que votre routeur est configuré, vous pouvez obtenir votre adresse IP externe (WAN), par exemple en [utilisant Google](https://www.google.com/search?q=what+is+my+ip). Donnez cette adresse à vos amis pour qu'ils puissent se connecter à votre serveur (_mais voir aussi la note sur le DNS dynamique ci-dessous_). Vous devez vous-même vous connecter à votre propre ordinateur à la place, puisque c'est votre ordinateur qui fait tourner le serveur. Donc **seulement vous** devez vous connecter à `127.0.0.1`.

source: ### Points to note
es: ### Puntos a tener en cuenta
fr: ### Points à noter

source: You do not need to open a port range as shown in the example above as long as you want to start only one instance of the Jamulus server on the same machine.
es: No necesitas abrir un rango de puertos como muestra el ejemplo de arriba si solo vas a abrir una instancia del servidor Jamulus en tu ordenador.
fr: Vous n'avez pas besoin d'ouvrir une plage de ports comme indiqué dans l'exemple ci-dessus tant que vous ne souhaitez démarrer qu'une seule instance du serveur Jamulus sur la même machine.

source: If using a different port than the default port (22124) you have to enter the port number after the server name or IP address separated by a colon in the Jamulus client (e.g. jamulus.example.org:22120).
es: Si utilizas un puerto distinto al que se usa por defecto (22124) tienes que escribir el número del puerto detrás del nombre del servidor o la dirección IP, separado por dos puntos, en el cliente de Jamulus (por ej. jamulus.ejemplo.org:22120).
fr: Si vous utilisez un port différent du port par défaut (22124), vous devez entrer le numéro de port après le nom du serveur ou l'adresse IP, séparé par deux points dans le client Jamulus (par exemple, jamulus.example.org:22120).

source: See also this excellent [guide to running a private server](https://www.facebook.com/notes/jamulus-online-musicianssingers-jamming/how-to-create-a-private-server-for-band-rehearsals/508642543044030/) by [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) on Facebook.
es: Ver también esta excelente [guía sobre la operación de un servidor privado](https://www.facebook.com/notes/jamulus-online-musicianssingers-jamming/how-to-create-a-private-server-for-band-rehearsals/508642543044030/) de [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) en Facebook.
fr: Voir également l'excellent [guide sur la gestion d'un serveur privé](https://www.facebook.com/notes/jamulus-online-musicianssingers-jamming/how-to-create-a-private-server-for-band-rehearsals/508642543044030/) de [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) sur Facebook.

source: ## Dynamic DNS and why you will probably need it
es: ## DNS dinámica y por qué es probable que lo necesites
fr: ## DNS dynamique et pourquoi vous en aurez probablement besoin

source: Most domestic Internet connections will change their IP address after a period (hours, days or weeks). To make it easier for people to connect to you, you may therefore also want set up a dynamic DNS address. You can do this on [the machine](https://www.online-tech-tips.com/computer-tips/ddns-dynamic-dns-service/) that you are running the Jamulus server on, or preferably your router [may support it](https://www.noip.com/support/knowledgebase/how-to-configure-ddns-in-router/).
es: La mayoría de las conexiones domésticas a internet cambian su dirección IP tras un periodo de tiempo (horas, días o semanas). Por tanto, para facilitar que las personas se puedan conectar a ti, probablemente quieras establecer una dirección DNS dinámica. Puedes hacer esto en [el ordenador](https://www.online-tech-tips.com/computer-tips/ddns-dynamic-dns-service/) en el cual ejecutas el servidor Jamulus, o preferiblemente en tu router [si es compatible](https://www.noip.com/support/knowledgebase/how-to-configure-ddns-in-router/).
fr: La plupart des connexions Internet domestiques changent d'adresse IP après un certain temps (heures, jours ou semaines). Pour que les gens puissent plus facilement se connecter à votre serveur, vous voudrez peut-être aussi configurer une adresse DNS dynamique. Vous pouvez le faire sur [la machine] (https://www.online-tech-tips.com/computer-tips/ddns-dynamic-dns-service/) sur laquelle vous exécutez le serveur Jamulus, ou de préférence sur votre routeur [qui peut le prendre en charge] (https://www.noip.com/support/knowledgebase/how-to-configure-ddns-in-router/).

source: Note also that your home router may also change the IP address of the machine that you are running your server on. In which case you may need either to give that machine a static IP in the router's DHCP configuration, or simply port forward to all the addresses in your LAN.
es: Nótese también que tu router doméstico puede cambiar la dirección IP del ordenador en el que ejecutas tu servidor. En este caso, tienes que darle a ese ordenador una IP estática en la configuración DHCP del router, o simplemente abre los puertos a todas las direcciones en tu red local.
fr: Notez également que votre routeur domestique peut également modifier l'adresse IP de la machine sur laquelle vous exécutez votre serveur. Dans ce cas, vous devrez soit donner à cette machine une adresse IP statique dans la configuration DHCP du routeur, soit simplement faire un transfert de port vers toutes les adresses de votre réseau local.

source: ## Footnote for geeks
es: ## Nota para frikis
fr: ## Note de bas de page pour les geeks

source: One of the many features of Jamulus that make it orgasmically wonderful is the fact that you can set up a server in seconds. But why do public servers not need port forwarding to do this?
es: Una de las muchas características de Jamulus que lo hacen orgásmicamente maravilloso es que puedes montar un servidor en segundos. ¿Pero los servidores públicos por qué no necesitan la validación de puertos?
fr: L'une des nombreuses caractéristiques de Jamulus qui le rendent merveilleusement bien est le fait que vous pouvez configurer un serveur en quelques secondes. Mais pourquoi les serveurs publics n'ont-ils pas besoin de la redirection de port pour ce faire ?

source: Normally, network address translation (NAT) firewalls prevent incoming requests initiated from outside the local network. Inbound traffic is only possible for packets _relating to an outbound request_ (strictly speaking, "related" and "established" packets to an initial outbound connection). In public mode, when your Jamulus server connects to a Directory Server it of course initiates an outbound connection. From then on, the Directory Server sends (established/related) connection "pings" (not ICMP pings) to your server at regular intervals to keep the relevant NAT port(s) open on your router/firewall.
es: Normalmente, los cortafuegos NAT impiden las peticiones externas desde fuera de la red local. El tráfico entrante solo es posible para paquetes _relacionados con una petición saliente_ (estrictamente hablando, paquetes de "relación" y "establecimiento" con una conexión inicial saliente). En modo público, cuando un servidor Jamulus se conecta a un Servidor de Directorio, inicia una conexión saliente. De ahí en adelante, el Servidor de Directorio envía "pings" de conexión (establecimiento/relación; no pings ICMP) a ese servidor a intervalos regulares para mantener abierto(s) el/los puerto(s) relevantes en el router/cortafuegos.
fr: Normalement, les pare-feu NAT (Network Address Translation) empêchent les requêtes entrantes provenant de l'extérieur du réseau local. Le trafic entrant n'est possible que pour les paquets _relatifs à une demande sortante_ (à proprement parler, les paquets "relatifs" et "établis" à une connexion sortante initiale). En mode public, lorsque votre serveur Jamulus se connecte à un serveur d'annuaire, il initie bien sûr une connexion sortante. À partir de ce moment-là, le serveur d'annuaire envoie des "pings" (pas des pings ICMP) de connexion (établie/liée) à votre serveur à intervalles réguliers pour maintenir le ou les ports NAT pertinents ouverts sur votre routeur/pare-feu.

source: However, in private mode clients have to _initiate_ connections into the server's network. NAT firewalls prevent this, so you need to tell them to allow incoming connection requests on the Jamulus port using port forwarding.
es: Sin embargo, en modo privado los clientes tienen que _iniciar_ conexiones a la red del servidor. Los cortafuegos NAT impiden esto, por lo que tienes que decirles que permitan peticiones de conexión entrantes en el puerto que Jamulus utiliza, mediante el redireccionamiento de puertos.
fr: Cependant, en mode privé, les clients doivent _initier_ les connexions au réseau du serveur. Les pare-feu NAT empêchent cela, vous devez donc leur dire d'autoriser les demandes de connexion entrantes sur le port Jamulus en utilisant la redirection de port.
