Repository: jamulussoftware/jamulussoftware.github.io
Catalog: _translator-files/po/*/Running-a-Server.po
Languages: es, fr

source: en
es: es
fr: fr

source: Running a Server
es: Ejecutar un Servidor
fr: Exécuter un serveur

source: # Running a Server
es: # Ejecutar un Servidor
fr: # Exécuter un serveur

source: ## Do I need to run a server to use Jamulus?
es: ## ¿Necesito ejecutar un servidor para utilizar Jamulus?
fr: ## Dois-je faire tourner un serveur pour utiliser Jamulus ?

source: NO. {: .doubletextsize .red }
fr: NON. {: .doubletextsize .red }

source: You can just choose somebody else's server from your list and get going.
es: Puedes simplemente escoger otro servidor de la lista y utilizarlo.
fr: Vous pouvez simplement choisir le serveur de quelqu'un d'autre dans votre liste et vous lancer.

source: **Don't want strangers interrupting?** Once you and your friends are connected to a public server, press the "solo" buttons on the musicians each of you want to play with. Anyone you don't solo will see a "muted" icon on your fader. And you won't hear them.
es: **¿No quieres interrupciones de extraños?** Una vez que tú y tus compañeros/as se hayan conectado a un servidor público, pulsa el botón de "solo" de cada músico con quien quieres tocar. Aquellos para quienes no actives este botón verán un icono de "silenciado" en tu canal. Y no les escucharás.
fr: **Vous ne voulez pas être interrompu par des inconnus ?** Une fois que vous et vos amis êtes connectés à un serveur public, appuyez sur les boutons "solo" des musiciens avec lesquels chacun d'entre vous veut jouer. Tous ceux que vous ne mettez pas en solo verront une icône "muted" sur votre fader. Et vous ne les entendrez pas.

source: ## That sounds too easy.
es: ## Eso suena demasiado fácil.
fr: ## Cela semble trop facile.

source: If you really want to run a server, it's **very important** that you read and understand what type of server you want to run.
es: Si realmente quieres operar un servidor, es **muy importante** que leas y entiendas qué tipo de servidor quieres operar.
fr: Si vous voulez vraiment gérer un serveur, il est **très important** que vous lisiez et compreniez quel type de serveur vous voulez gérer.

source: <div class="fx-row fx-row-start-xs button-container"> <a href="Choosing-a-Server-Type" class="button fx-col-100-xs" target="_blank" rel="noopener noreferrer">Read about server types</a> </div>
es: <div class="fx-row fx-row-start-xs button-container"> <a href="Choosing-a-Server-Type" class="button fx-col-100-xs" target="_blank" rel="noopener noreferrer">Lee sobre los tipos de servidor</a> </div>
fr: <div class="fx-row fx-row-start-xs button-container"> <a href="Choosing-a-Server-Type" class="button fx-col-100-xs" target="_blank" rel="noopener noreferrer">Lecture sur les types de serveurs</a> </div>

source: then come back here.
es: y luego vuelve aquí.
fr: puis revenez ici.

source: ### Speed and latency
es: ### Velocidad y latencia
fr: ### Vitesse et latence

source: **_The capability of the server itself (and the network it's on) is NOT the main determinant of the quality of a Jamulus session!_**
es: **_La capacidad del servidor en sí (y de la red en la que opera) NO es el factor más determinante para la calidad de una sesión con Jamulus_**
fr: **_La capacité du serveur lui-même (et du réseau sur lequel il se trouve) n'est PAS le principal déterminant de la qualité d'une session Jamulus!_**

source: Many people attribute problems to the server that are in fact problems with the _client_. Much depends on the clients' [hardware](Hardware-Setup), the networks that _they_ are on, and whether they are sticking to [Rule Number One](Getting-Started#having-trouble-cant-keep-in-time). There is therefore no guarantee that you will achieve lower latency or better overall performance by having your own server.
es: Mucha gente atribuye problemas al servidor que en realidad son problemas con el _cliente_. Mucho depende del [hardware](Hardware-Setup) del cliente, las redes en las que _opera_, y su adherencia a la [Regla Número Uno](Getting-Started#tienes-problemas-no-puedes-mantener-el-tiempo). Por tanto, no hay ninguna garantía de que conseguirás una latencia más baja o un rendimiento superior ejecutando tu propio servidor.
fr: De nombreuses personnes attribuent au serveur des problèmes qui sont en fait des problèmes du _client_. Cela dépend en grande partie du [matériel](Hardware-Setup) des clients, des réseaux sur lesquels ils se trouvent et de leur respect de la [règle numéro un](Getting-Started#having-trouble-cant-keep-in-time). Il n'y a donc aucune garantie que vous obtiendrez une latence plus faible ou de meilleures performances générales en ayant votre propre serveur.

source: If you plan to be playing regularly with the same people, **you are strongly advised** to first make sure that each member of the group is set up to use Jamulus properly. Do this by finding a public server with a reasonable ping time for all of you (20 ms or less perhaps), all connect to that and work to fix any individual issues (verifying that they can [follow Rule Number One](Getting-Started#having-trouble-cant-keep-in-time) in particular). Use the solo technique above to prevent being interrupted if needed.
es: Si tienes intención de tocar regularmente con las mismas personas, **se recomienda encarecidamente** que primero os aseguréis de que cada miembro del grupo tiene la configuración adecuada para utilizar Jamulus. Haz esto buscando un servidor público con un tiempo de ping razonablemente bajo para todos (20 ms o menos quizá), os conectáis todos allí y trabajáis para solucionar cualquier problema individual (verificando que pueden seguir la [Regla Número Uno](Getting-Started#tienes-problemas-no-puedes-mantener-el-tiempo) en particular). Utiliza la técnica descrita arriba de usar el botón de "solo" para impedir interrupciones si es necesario.
fr: Si vous prévoyez de jouer régulièrement avec les mêmes personnes, **il vous est fortement conseillé** de vous assurer d'abord que chaque membre du groupe est configuré pour utiliser Jamulus correctement. Pour ce faire, trouvez un serveur public avec un temps de ping raisonnable pour vous tous (20 ms ou moins, par exemple), connectez-vous tous à ce serveur et essayez de résoudre les problèmes individuels (en vérifiant qu'ils peuvent [suivre la règle numéro un](Getting-Started#having-trouble-cant-keep-in-time) en particulier). Utilisez la technique du solo ci-dessus pour éviter d'être interrompu si nécessaire.

source: Once any issues with musicians have been solved in this way, you can then investigate hosting your own server either at home or on a cloud host such as Amazon, which may result in better latency than servers run at home. For example, [see this guide](https://www.facebook.com/notes/jamulus-worldjam/howto-idiots-guide-to-installing-or-upgrading-a-jamulus-server-on-amazon-aws-lig/818091045662521/) for using AWS Lightsail, by Jamulus user [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) (_Facebook_)
es: Una vez se haya solucionado cualquier problema que puedan tener los músicos, ahora puedes investigar sobre cómo ejecutar tu propio servidor en casa o en un host en la nube como Amazon, que puede resultar en una mejor latencia que con servidores ejecutados en casa. Por ejemplo, [ver esta guía](https://www.facebook.com/notes/jamulus-worldjam/howto-idiots-guide-to-installing-or-upgrading-a-jamulus-server-on-amazon-aws-lig/818091045662521/) para utilizar AWS Lightsail por parte del usuario de Jamulus [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) (_Facebook_)
fr: Une fois que tous les problèmes avec les musiciens ont été résolus de cette manière, vous pouvez alors envisager d'héberger votre propre serveur, soit à la maison, soit sur un hôte en nuage tel qu'Amazon, ce qui peut donner lieu à une meilleure latence que les serveurs gérés à la maison. Par exemple, [voir ce guide](https://www.facebook.com/notes/jamulus-worldjam/howto-idiots-guide-to-installing-or-upgrading-a-jamulus-server-on-amazon-aws-lig/818091045662521/) pour utiliser AWS Lightsail, par l'utilisateur de Jamulus [Simon Tomlinson](https://www.facebook.com/simon.james.tomlinson?eid=ARBQoY3KcZAtS3pGdLJuqvQTeRSOo4gHdQZT7nNzOt1oPMGgZ4_3GERe-rOyH5PxsSHVYYXjWwcqd71a) (_Facebook_).

source: ### Bandwidth – do you have enough?
es: ### Ancho de banda - ¿tienes suficiente?
fr: ### Bande passante - en avez-vous assez ?

source: A typical jam might have 4 people, for which you would need 200 Kbit/s * 4 = 800 Kbit/s (0.8 Mbit/s) up and down. So if you have a 10 Mbit/s down and 1 Mbit/s up broadband connection, **you may start running out of bandwidth if a fifth player joins**, particularly if other musicians choose settings that increase their usage. You may want to [check that you have enough speed](https://fast.com) for that. [Read more about bandwidth use](Network-Requirements) at different quality settings.
es: En una jam típica puede haber 4 personas, para lo que necesitarías 200 Kbit/s * 4 = 800 Kbit/s (0,8 Mbit/s) de subida y bajada. Así que si tienes 10 Mbit/s de bajada y 1 Mbit/s de subida de banda ancha, **puede ser que te empiece a escasear el ancho de banda si se une una quinta persona**, sobre todo si otros músicos eligen configuraciones que aumentan su uso. Quizá quieras [comprobar que tienes velocidad suficiente](https://fast.com) para ello. [Lee más sobre el uso de ancho de banda](Network-Requirements) con diferentes configuraciones de calidad.
fr: Une jam typique peut compter 4 personnes, pour lesquelles vous avez besoin de 200 Kbit/s * 4 = 800 Kbit/s (0,8 Mbit/s) en amont et en aval. Donc, si vous disposez d'une connexion à large bande de 10 Mbit/s en aval et de 1 Mbit/s en amont, **vous risquez de manquer de bande passante si un cinquième joueur vous rejoint**, en particulier si d'autres musiciens choisissent des paramètres qui augmentent leur utilisation. Vous pouvez [vérifier que votre vitesse est suffisante](https://fast.com) pour cela. En savoir plus sur [l'utilisation de la bande passante](Network-Requirements) à différents niveaux de qualité.

source: ### In general
es: ### En general
fr: ### En général

source: Consider using a cloud host to get better ping times if you're having problems
es: Considera el uso de un host en la nube para conseguir mejores tiempos de ping si tienes problemas
fr: Envisagez d'utiliser un hôte en nuage pour obtenir de meilleurs temps de ping si vous avez des problèmes.

source: Any server should have at least 1.6GHz CPU frequency and 1GB RAM
es: Cualquier servidor debería de tener una frecuencia de procesador de 1,6 GHz y 1 GB de RAM
fr: Tout serveur doit avoir une fréquence de CPU d'au moins 1,6 GHz et 1 Go de RAM.

source: Running a server may require you to adjust any firewalls running on or outside of your machine or cloud host.
es: Ejecutar un servidor puede requerir que configures cortafuegos operando en tu ordenador o host en la nube, o externos.
fr: L'exécution d'un serveur peut nécessiter l'ajustement de tout pare-feu fonctionnant sur ou en dehors de votre machine ou de votre hôte cloud.

source: Running a **private server at home** (but not a public one) will require you to [port forward](Running-a-Private-Server) on your router.
es: Ejecutar un **servidor privado en casa** (pero no uno público) requerirá que [redirecciones puertos](Running-a-Private-Server) en tu router.
fr: L'exécution d'un **serveur privé à domicile** (mais pas d'un serveur public) nécessitera que vous fassiez un [port forward](Running-a-Private-Server) sur votre routeur.

source: Jamulus doesn't currently support IPv6
es: Actualmente Jamulus no da soporte para IPv6
fr: Jamulus ne prend pas actuellement en charge l'IPv6.

source: ## All OK? Get set up!
es: ## ¿Todo bien? ¡A configurar!
fr: ## Tout va bien ? Installez-vous !

source: <div class="fx-row fx-row-start-xs button-container"> <a href="Server-Win-Mac" class="button fx-col-100-xs">For Windows or macOS users</a> <a href="Server-Linux" class="button fx-col-100-xs">For Linux users</a> </div>
es: <div class="fx-row fx-row-start-xs button-container"> <a href="Server-Win-Mac" class="button fx-col-100-xs">Para usuarios de Windows o macOS</a> <a href="Server-Linux" class="button fx-col-100-xs">Para usuarios de Linux</a> </div>
fr: <div class="fx-row fx-row-start-xs button-container"> <a href="Server-Win-Mac" class="button fx-col-100-xs">Pour les utilisateurs de Windows ou macOS</a> <a href="Server-Linux" class="button fx-col-100-xs">Pour les utilisateurs de Linux</a> </div>

source: If you want to run a server on a Raspberry Pi, have a look at the [guide for Raspberry Pi](/kb/2020/03/28/Server-Rpi.html) by fredsiva.
es: Si quieres ejecutar un servidor en un Raspberry Pi, echa un vistazo a la [guía para Raspberry Pi](/kb/2020/03/28/Server-Rpi.html) de fredsiva.
fr: Si vous souhaitez faire fonctionner un serveur sur un Raspberry Pi, jetez un œil au [guide pour Raspberry Pi](/kb/2020/03/28/Server-Rpi.html) de fredsiva.

source: Server operators may also be interested in downloading [this set of useful tools](https://github.com/jamulussoftware/jamulus/tree/master/tools) from the Jamulus repository (clone the Git repo and also call `git submodule update --init`).
es: Los operadores de servidores también pueden descargarse [este conjunto de herramientas útiles](https://github.com/jamulussoftware/jamulus/tree/master/tools) del repositorio de Jamulus (clona el repositorio de Git y ejecuta `git submodule update --init`).
fr: Les opérateurs de serveur peuvent également être intéressés par le téléchargement de [cet ensemble d'outils utiles](https://github.com/jamulussoftware/jamulus/tree/master/tools) depuis le dépôt Jamulus (clonez le dépôt Git et appelez également `git submodule update --init`).

source: ## Having problems? Got issues?
es: ## ¿Experimentando problemas?
fr: ## Vous avez des problèmes ? Vous avez des problèmes ?

source: See the [Server Troubleshooting FAQ](Server-Troubleshooting)
es: Consulta el [FAQ de Resolución de Problemas con el Servidor](Server-Troubleshooting)
fr: Consultez la [FAQ sur le dépannage du serveur](Server-Troubleshooting)
