Repository: jamulussoftware/jamulussoftware.github.io
Catalog: _translator-files/po/*/Server-Linux.po
Languages: fr

source: en
fr: fr

source: Server Installation - Linux
fr: Installation d'un serveur - Linux

source: {% include breadcrumb.html root="Using Jamulus" branch1="Running a Server" branch1-url="Running-a-Server" %}
fr: {% include breadcrumb.html root="More" branch1="Running a Server" branch1-url="Running-a-Server" %}

source: # Server Installation - Linux
fr: # Installation d'un serveur - Linux

source: **_Please ensure you have read the [server overview](Running-a-Server)_**
fr: **_Veuillez vous assurer que vous avez lu la page [Exécuter un serveur](Running-a-Server)_**

source: ## Running a server with a GUI on a desktop machine
fr: ## Exécution d'un serveur avec une interface graphique sur une machine de bureau

source: If you have installed the Jamulus client, you can run it in your chosen [server mode](Choosing-a-Server-Type) by running Jamulus with the `-s` option as follows:
fr: Si vous avez installé le client Jamulus, vous pouvez l'exécuter dans le [mode serveur](Choosing-a-Server-Type) de votre choix en exécutant Jamulus avec l'option `-s` comme suit :

source: Open a terminal window (`CTRL+ALT+t` on Ubuntu and related distros).
fr: Ouvrez une fenêtre de terminal (`CTRL+ALT+t` sur Ubuntu et les distros apparentées).

source: Assuming Jamulus is in `/usr/local/bin`, type `Jamulus -s`
fr: En supposant que Jamulus se trouve dans `/usr/local/bin`, tapez `Jamulus -s`.

source: Hit return and you should see the server control window. You can stop the server by closing the server window, or by using `CTRL+C` in the terminal.
fr: Appuyez sur return et vous devriez voir la fenêtre de contrôle du serveur. Vous pouvez arrêter le serveur en fermant la fenêtre du serveur, ou en utilisant `CTRL+C` dans le terminal.

source: **To configure the server**, please refer to [the Windows & macOS instructions](Server-Win-Mac), and [Command Line Options](Command-Line-Options) for other parameters you can set.
fr: **Pour configurer le serveur**, veuillez vous référer aux [instructions pour Windows et macOS] (Server-Win-Mac), et aux [options de la ligne de commande] (Command-Line-Options) pour les autres paramètres que vous pouvez définir.

source: ## Running a "headless" server
fr: ## Exécution d'un serveur "headless"

source: The following is for running Jamulus as a "pure" server on **hardware without audio** (e.g. on a 3rd party/cloud host) and assumes Ubuntu/Debian distributions using systemd. We also have instructions for [Raspberry Pi](Server-Rpi).
fr: Ce qui suit concerne l'exécution de Jamulus en tant que serveur "pur" sur du **matériel sans audio** (par exemple, sur un hôte tiers/cloud) et suppose des distributions Ubuntu/Debian utilisant systemd. Nous avons également des instructions pour [Raspberry Pi] (Server-Rpi).

source: Download the [latest headless .deb file]({{ site.download_root_link }}{{ site.download_file_names.deb-headless }})
fr: Téléchargez le [dernier fichier .deb sans tête]({{ site.download_root_link }}{ site.download_file_names.deb-headless }})

source: Update apt to make sure you have a current list of standard packages: `sudo apt update`
fr: Mettez à jour apt pour vous assurer que vous avez une liste actuelle de paquets standard : `sudo apt update`

source: Install the Jamulus package: `sudo apt install ./{{ site.download_file_names.deb-headless }}`
fr: Installez le paquet Jamulus : `sudo apt install ./{{ site.download_file_names.deb-headless }}`

source: Enable the headless server process via systemd: `sudo systemctl enable jamulus-headless`
fr: Activez le processus de serveur sans tête via systemd : `sudo systemctl enable jamulus-headless`.

source: Add your desired [command line options](Command-Line-Options) to the `ExecStart` line in the systemd service file in `/lib/systemd/system/jamulus-headless.service` (By default you will be running a private server).
fr: Ajoutez vos [options de ligne de commande] (Command-Line-Options) à la ligne `ExecStart` dans le fichier de service systemd dans `/lib/systemd/system/jamulus-headless.service` (Par défaut, vous allez exécuter un serveur privé).

source: Reload the systemd files `sudo systemctl daemon-reload` and restart the headless server: `sudo systemctl restart jamulus-headless`
fr: Rechargez les fichiers systemd `sudo systemctl daemon-reload` et redémarrez le serveur headless : `sudo systemctl restart jamulus-headless`

source: Check all is well with `service jamulus-headless status` (hit `q` to get back to the command prompt).
fr: Vérifiez que tout va bien avec `service jamulus-headless status` (tapez `q` pour revenir à l'invite de commande).

source: You can control Jamulus with the `service` command. For example, to stop the server cleanly:
fr: Vous pouvez contrôler Jamulus avec la commande `service`. Par exemple, pour arrêter le serveur proprement :

source: ### Viewing The Logs
fr: ### Visualisation des journaux

source: Jamulus will log to the system file if you left the `StandardOutput=journal` setting in the unit file. Logging to the system log is recommended, as the system will manage the log file for you - no need to come back and purge it later or worry about filling up your disk space.
fr: Jamulus se connectera au fichier système si vous avez laissé le paramètre `StandardOutput=journal` dans le fichier d'unité. Il est recommandé de se connecter au journal système, car le système gérera le fichier journal pour vous - pas besoin de revenir et de le purger plus tard ou de s'inquiéter de remplir votre espace disque.

source: To view the log, use `journalctl` (to exit press Ctrl-C). For example, to read the system log file, filtered for the Jamulus service:
fr: Pour visualiser le journal, utilisez `journalctl` (pour quitter, appuyez sur Ctrl-C). Par exemple, pour lire le fichier journal du système, filtré pour le service Jamulus :

source: For today’s entries:
fr: Pour les entrées d'aujourd'hui :

source: For the last hour:
fr: Pour la dernière heure :

source: Filter the log to see connection messages for your Jamulus server:
fr: Filtrez le journal pour voir les messages de connexion de votre serveur Jamulus :

source: Follow (show on screen) Jamulus log messages as they occur:
fr: Suivez (affichez à l'écran) les messages du journal de Jamulus au fur et à mesure qu'ils se produisent :

source: ### Upgrading
fr: ### Mise à niveau

source: To upgrade your server to a newer version, simply download a new .deb and re-install as step 3.
fr: Pour mettre à niveau votre serveur vers une version plus récente, téléchargez simplement un nouveau fichier .deb et réinstallez comme à l'étape 3.

source: ### Recording
fr: ### Enregistrement

source: See [this information](/wiki/Tips-Tricks-More#controlling-recordings-on-linux-headless-servers) on controlling recordings on headless servers.
fr: Voir [cette information](/wiki/Tips-Tricks-More#contrôle-des-enregistrements-sur-les-serveurs-headless-linux) sur le contrôle des enregistrements sur les serveurs headless.
