Repository: jamulussoftware/jamulussoftware.github.io
Catalog: _translator-files/po/*/Server-Win-Mac.po
Languages: fr

source: en
fr: fr

source: Server Installation - Windows and macOS
fr: Installation d'un serveur - Windows et macOS

source: {% include breadcrumb.html root="Using Jamulus" branch1="Running a Server" branch1-url="Running-a-Server" %}
fr: {% include breadcrumb.html root="More" branch1="Running a Server" branch1-url="Running-a-Server" %}

source: # Installation for Windows and macOS
fr: # Installation pour Windows et macOS

source: **_Please ensure you have read the [server overview](Running-a-Server)_**
fr: **_Veuillez vous assurer que vous avez lu la page [Exécuter un serveur](Running-a-Server)_**

source: **Windows users** - Start the server using the entry for "Jamulus server" in the Windows start menu.
fr: **Utilisateurs de Windows** - Démarrez le serveur en utilisant l'entrée "Serveur Jamulus" dans le menu de démarrage de Windows.

source: **macOS users** - Double-click the "Jamulus server" icon in Applications (assuming you put the files from the install there as per [these instructions](Installation-for-Macintosh)).
fr: **Utilisateurs de macOS** - Double-cliquez sur l'icône "Serveur Jamulus" dans Applications (en supposant que vous y avez placé les fichiers de l'installation conformément à [ces instructions](Installation-for-Macintosh)).

source: <figure><img src="{{site.url}}/assets/img/en-screenshots/server-window-setup.png" loading="lazy" alt="Image of the Jamulus server setup window"></figure>
fr: <figure><img src="{{site.url}}/assets/img/fr-screenshots/server-window-setup.png" loading="lazy" alt="Image de la fenêtre de configuration du serveur Jamulus"></figure>

source: ### Public server setup
fr: ### Configuration du serveur public

source: On checking "Make My Server Public" you should see a confirmation message saying whether your server has registered successfully.
fr: En cochant "Rendre mon serveur public", vous devriez voir un message de confirmation indiquant si votre serveur a été enregistré avec succès.

source: Type in the name, city and country so that other users can easily identify you.
fr: Saisissez le nom, la ville et le pays afin que les autres utilisateurs puissent facilement vous identifier.

source: Specify a music genre. This will make your server appear in the relevant server list for clients (see more [details on Directory Servers](Directory-Servers)).
fr: Spécifiez un genre musical. Cela fera apparaître votre serveur dans la liste des serveurs pertinents pour les clients (voir plus de [détails sur les serveurs annuaires](Directory-Servers)).

source: _The Chat Welcome Message appears to all users when they join the server (the chat window will open automatically for them)._
fr: _Le message de bienvenue du chat apparaît à tous les utilisateurs lorsqu'ils rejoignent le serveur (la fenêtre de tchate s'ouvre automatiquement pour eux)._

source: ### Private server setup
fr: ### Configuration d'un serveur privé

source: If you do not check "Make My Server Public", you will be running a private server and need to [read these instructions](Running-a-Private-Server).
fr: Si vous ne cochez pas la case "Rendre mon serveur public", vous allez exécuter un serveur privé et vous devez [lire ces instructions](Running-a-Private-Server).

source: _If you want to **run a client on the same machine** you should **connect the client to `127.0.0.1`** for best performance. (Similarly, if you want to connect a client on another machine on your LAN, use the server's LAN IP address)._
fr: _Si vous voulez **exécuter un client sur la même machine**, vous devez **connecter le client à `127.0.0.1`** pour de meilleures performances. De même, si vous voulez connecter un client sur une autre machine de votre réseau local, utilisez l'adresse IP du réseau local du serveur)._

source: ### Other options
fr: ### Autres options

source: ### Recording
fr: ### Enregistrement

source: Turn on server recording by first setting the Recording Directory in the Options tab. Recording starts once the first person connects to the server, and stops when the last person leaves. Use the "New Recording" button to create a new sub-directory in which the recordings will be stored. Note that Recordings are per track in [Audacity](https://www.audacityteam.org/) `.lof` format and [REAPER](https://en.wikipedia.org/wiki/REAPER) `.rpp`. Open the respective files to listen to them in those applications.
fr: Activez l'enregistrement du serveur en définissant d'abord le répertoire d'enregistrement dans l'onglet Options. L'enregistrement commence dès que la première personne se connecte au serveur et s'arrête lorsque la dernière personne quitte le serveur. Utilisez le bouton "New Recording" pour créer un nouveau sous-répertoire dans lequel les enregistrements seront stockés. Notez que les enregistrements sont par piste au format [Audacity](https://www.audacityteam.org/) `.lof` et [REAPER](https://en.wikipedia.org/wiki/REAPER) `.rpp`. Ouvrez les fichiers respectifs pour les écouter dans ces applications.

source: _Note: When your server is recording, clients will display a message that recording is on._
fr: _Remarque : Lorsque votre serveur enregistre, les clients affichent un message indiquant que l'enregistrement est en cours._

source: For headless servers: you can control the recording function [using these instructions](Server-Linux#controlling-recordings).
fr: Pour les serveurs sans tête : vous pouvez contrôler la fonction d'enregistrement [en utilisant ces instructions](Server-Linux#enregistrement).

source: ### Delay panning
fr: ### Retardement du panoramique

source: This option uses small differences in sound arrival time between the two ears. It produces a stereo effect similar to natural human hearing when compared to normal "volume" panning. Note that to achieve the effect, all clients should be set to 'mono in / stereo out' (or to 'stereo', but only if transmitting a stereo signal).
fr: Cette option utilise les petites différences de temps d'arrivée du son entre les deux oreilles. Elle produit un effet stéréo similaire à l'audition humaine naturelle par rapport à un panoramique normal de "volume". Notez que pour obtenir cet effet, tous les clients doivent être réglés sur 'mono in / stereo out' (ou sur 'stereo', mais seulement s'ils transmettent un signal stéréo).

source: ### Custom Central Server Address
fr: ### Adresse du serveur annuaire personnalisé

source: <figure><img src="{{site.url}}/assets/img/en-screenshots/server-window-options.png" loading="lazy" alt="Image of Jamulus server window options"></figure>
fr: <figure><img src="{{site.url}}/assets/img/fr-screenshots/server-window-options.png" loading="lazy" alt="Image of Jamulus server window options"></figure>

source: (Leave this field empty unless you need to list your server on a [private central server](Choosing-a-Server-Type#3-directory))
fr: (Laissez ce champ vide à moins que vous n'ayez besoin d'inscrire votre serveur sur un [serveur annuaire privé](Choosing-a-Server-Type#3-serveur-annuaire)).

source: **Windows users** - If you want the server to start automatically on system start, enable the corresponding check box.
fr: **Utilisateurs de Windows** - Si vous voulez que le serveur démarre automatiquement au démarrage du système, activez la case à cocher correspondante.

source: (Leave the "Custom Directory Server Address" field empty unless you need to list your server on a [private directory server](Choosing-a-Server-Type#3-directory))
fr: (Laissez le champ "Adresse personalisée du serveur annuaire" vide, sauf si vous devez inscrire votre serveur sur un [serveur annuaire privé](Choosing-a-Server-Type#3-serveur-annuaire)).

source: See also [Command Line Options](Command-Line-Options) for other parameters you can set.
fr: Voir également [Options de la ligne de commande](Command-Line-Options) pour les autres paramètres que vous pouvez définir.
