Repository: jamulussoftware/jamulussoftware.github.io
Catalog: translator-files/po/*/Server-Win-Mac.po
Languages: es

source: en
es: es

source: Server Installation - Windows and macOS
es: Instalación de Servidor - Windows y macOS

source: {% include breadcrumb.html root="Using Jamulus" branch1="Running a Server" branch1-url="Running-a-Server" %}
es: {% include breadcrumb.html root="Más" branch1="Ejecutar un Servidor" branch1-url="Running-a-Server" %}

source: # Installation for Windows and macOS
es: # Instalación en Windows y macOS

source: **_Please ensure you have read the [server overview](Running-a-Server)_**
es: **_Primero asegúrate de leer la [descripción de servidores](Running-a-Server)_**

source: **Windows users** - Start the server using the entry for "Jamulus server" in the Windows start menu.
es: **Usuarios de Windows** - Arranca el servidor utilizando la entrada de "Jamulus server" en el menú de inicio de Windows.

source: **macOS users** - Double-click the "Jamulus server" icon in Applications (assuming you put the files from the install there as per [these instructions](Installation-for-Macintosh)).
es: **Usuarios de macOS** - Haz doble clic en el icono de "Jamulus server" en Aplicaciones (suponiendo que has depositado los archivos allí siguiendo [estas instrucciones](Installation-for-Macintosh)).

source: **Linux users** - Please refer to the [GUI server instructions](Server-Linux#running-a-server-with-the-gui).
es: **Usuarios de Linux** - Consulta las [instrucciones para el servidor con interfaz gráfica](Server-Linux#ejecutar-el-servidor-con-interfaz-grafica-en-un-pc-de-escritorio).

source: <figure><img src="{{site.url}}/assets/img/en-screenshots/server-window-setup.png" loading="lazy" alt="Image of the Jamulus server setup window"></figure>
es: <figure><img src="{{site.url}}/assets/img/es-screenshots/server-window-setup.png" loading="lazy" alt="Imagen de la ventana de configuración del servidor Jamulus"></figure>

source: ### Public server setup
es: ### Configuración de servidor público

source: On checking "Make My Server Public" you should see a confirmation message saying whether your server has registered successfully.
es: Al activar "Mi Servidor es Público" deberías de ver un mensaje de confirmación de que tu servidor se ha registrado correctamente.

source: Type in the name, city and country so that other users can easily identify you.
es: Escribe el nombre, la ciudad y el país para que otros usuarios puedan identificarte con facilidad.

source: Specify a music genre. This will make your server appear in the relevant server list for clients (see more [details on Directory Servers](Directory-Servers)).
es: Especifica un género musical. Esto hará que tu servidor aparezca en la lista relevante para los clientes (ver más [detalles sobre los Servidores de Directorio](Directory-Servers)).

source: _The Chat Welcome Message appears to all users when they join the server (the chat window will open automatically for them)._
es: _La ventana del Mensaje de Bienvenida aparece a todos los usuarios cuando se conectan al servidor (para ellos se abrirá la ventana automáticamente)._

source: ### Private server setup
es: ### Configuración de servidor privado

source: If you do not check "Make My Server Public", you will be running a private server and need to [read these instructions](Running-a-Private-Server).
es: Si no activas "Mi Servidor es Público", estarás ejecutando un servidor privado y debes [leer estas instrucciones](Running-a-Private-Server).

source: _If you want to **run a client on the same machine** you should **connect the client to `127.0.0.1`** for best performance. (Similarly, if you want to connect a client on another machine on your LAN, use the server's LAN IP address)._
es: _Si quieres **ejecutar un cliente en la misma máquina** tienes que **conectar el cliente a `127.0.0.1`** para un rendimiento óptimo. (Similarmente, si quieres conectar un cliente en otra máquina de tu red local, utiliza la dirección IP de red local del servidor)._

source: ### Other options
es: ### Otras opciones

source: ### Recording
es: ### Grabación

source: Turn on server recording by first setting the Recording Directory in the Options tab. Recording starts once the first person connects to the server, and stops when the last person leaves. Use the "New Recording" button to create a new sub-directory in which the recordings will be stored. Note that Recordings are per track in [Audacity](https://www.audacityteam.org/) `.lof` format and [REAPER](https://en.wikipedia.org/wiki/REAPER) `.rpp`. Open the respective files to listen to them in those applications.
es: Primero activa la grabación por parte del servidor estableciendo el Directorio de Grabación en la pestaña de Opciones. La grabación comienza cuando la primera persona se conecta al servidor y se detiene cuando la última persona se marcha. Utiliza el botón de "Nueva Grabación" para crear un nuevo sub-directorio en el cual se guardarán las grabaciones. Nota: las grabaciones son por pistas en el formato `.lof` de [Audacity](https://www.audacityteam.org/) y `.rpp` de [REAPER](https://en.wikipedia.org/wiki/REAPER). Abre los archivos respectivos para escucharlos en estas aplicaciones.

source: _Note: When your server is recording, clients will display a message that recording is on._
es: _Nota: Cuando tu servidor está grabando, los clientes mostrarán un mensaje informando de que la grabación está activa._

source: For headless servers: you can control the recording function [using these instructions](Server-Linux#controlling-recordings).
es: Para servidores "headless": puedes controlar la función de grabación [siguiendo estas instrucciones](Server-Linux#grabación).

source: ### Delay panning
es: ### Paneo con retardo

source: This option uses small differences in sound arrival time between the two ears. It produces a stereo effect similar to natural human hearing when compared to normal "volume" panning. Note that to achieve the effect, all clients should be set to 'mono in / stereo out' (or to 'stereo', but only if transmitting a stereo signal).
es: Esta opción utiliza las pequeñas diferencias en el tiempo de llegada del sonido a nuestros dos oídos. Produce un efecto estéreo similar a la audición humana cuando se compara a un paneo de "volumen" normal. Ten en cuenta que para conseguir este efecto, los clientes deben estar configurados con 'entrada mono / salida estéreo' (o a 'estéreo', pero solo si transmiten una señal estéreo).

source: ### Custom Central Server Address
es: ### Dirección Personalizada del Servidor de Directorio

source: <figure><img src="{{site.url}}/assets/img/en-screenshots/server-window-options.png" loading="lazy" alt="Image of Jamulus server window options"></figure>
es: <figure><img src="{{site.url}}/assets/img/es-screenshots/server-window-options.png" loading="lazy" alt="Imagen de la ventana de opciones del servidor Jamulus"></figure>

source: (Leave this field empty unless you need to list your server on a [private central server](Choosing-a-Server-Type#3-directory))
es: (Deja este campo vacío a menos que necesites listar tu servidor en un [servidor de directorio privado](Choosing-a-Server-Type#3-directorio))

source: **Windows users** - If you want the server to start automatically on system start, enable the corresponding check box.
es: **Usuarios de Windows** - Si quieres que el servidor arranque automáticamente al iniciar el sistema, activa la casilla correspondiente.

source: (Leave the "Custom Directory Server Address" field empty unless you need to list your server on a [private directory server](Choosing-a-Server-Type#3-directory))
es: (Deja el campo de "Dirección Personalizada Servidor de Directorio" vacío a menos que necesites listar tu servidor en un [servidor de directorio privado](Choosing-a-Server-Type#3-directorio))

source: See also [Command Line Options](Command-Line-Options) for other parameters you can set.
es: Ver también [Opciones de Línea de Comandos](Command-Line-Options) para ver otros parámetros que se pueden establecer.
