Repository: jamulussoftware/jamulussoftware.github.io
Catalog: translator-files/po/*/Server-Linux.po
Languages: es

source: en
es: es

source: Server Installation - Linux
es: Instalación de Servidor - Linux

source: {% include breadcrumb.html root="Using Jamulus" branch1="Running a Server" branch1-url="Running-a-Server" %}
es: {% include breadcrumb.html root="Más" branch1="Ejecutar un Servidor" branch1-url="Running-a-Server" %}

source: # Server Installation - Linux
es: # Instalación de Servidor - Linux

source: **_Please ensure you have read the [server overview](Running-a-Server)_**
es: **_Primero asegúrate de leer la [descripción de servidores](Running-a-Server)_**

source: ## Running a server with a GUI on a desktop machine
es: ## Ejecutar el servidor con interfaz gráfica en un PC de escritorio

source: If you have installed the Jamulus client, you can run it in your chosen [server mode](Choosing-a-Server-Type) by running Jamulus with the `-s` option as follows:
es: Si has instalado el cliente Jamulus, puedes ejecutarlo en el [modo servidor](Choosing-a-Server-Type) que escojas ejecutando Jamulus con la opción `-s` como sigue:

source: Open a terminal window (`CTRL+ALT+t` on Ubuntu and related distros).
es: Abre una terminal (`CTRL+ALT+t` en Ubuntu y distros relacionadas).

source: Assuming Jamulus is in `/usr/local/bin`, type `Jamulus -s`
es: Suponiendo que Jamulus se encuentra en `/usr/local/bin`, teclea `Jamulus -s`

source: Hit return and you should see the server control window. You can stop the server by closing the server window, or by using `CTRL+C` in the terminal.
es: Dale a Enter y deberías ver la ventana del servidor. Puedes detener el servidor cerrando la ventana o tecleando `CTRL+C` en la terminal.

source: **To configure the server**, please refer to [the Windows & macOS instructions](Server-Win-Mac), and [Command Line Options](Command-Line-Options) for other parameters you can set.
es: **Para configurar el servidor**, por favor consulta [las instrucciones para Windows y macOS](Server-Win-Mac), y las [Opciones de Línea de Comandos](Command-Line-Options) para ver otros parámetros que se pueden establecer.

source: ## Running a "headless" server
es: ## Ejecutar un servidor "headless"

source: The following is for running Jamulus as a "pure" server on **hardware without audio** (e.g. on a 3rd party/cloud host) and assumes Ubuntu/Debian distributions using systemd. We also have instructions for [Raspberry Pi](Server-Rpi).
es: La siguiente guía es para ejecutar Jamulus como un servidor "puro" en **hardware sin audio** (por ej. en una máquina externa/host en la nube) y presupone el uso de distribuciones Ubuntu/Debian utilizando systemd. También tenemos instrucciones para [Raspberry Pi](Server-Rpi).

source: Download the [latest headless .deb file]({{ site.download_root_link }}{{ site.download_file_names.deb-headless }})
es: Descarga el [último archivo .deb para headless]({{ site.download_root_link }}{{ site.download_file_names.deb-headless }})

source: Update apt to make sure you have a current list of standard packages: `sudo apt update`
es: Actualiza apt para asegurarte de que tienes la lista actual de paquetes estándares: `sudo apt update`

source: Install the Jamulus package: `sudo apt install ./{{ site.download_file_names.deb-headless }}`
es: Instala el paquete de Jamulus: `sudo apt install ./{{ site.download_file_names.deb-headless }}`

source: Enable the headless server process via systemd: `sudo systemctl enable jamulus-headless`
es: Habilita el servidor 'headless' con systemd: `sudo systemctl enable jamulus-headless`

source: Add your desired [command line options](Command-Line-Options) to the `ExecStart` line in the systemd service file in `/lib/systemd/system/jamulus-headless.service` (By default you will be running a private server).
es: Añade las [opciones de línea de comandos](Command-Line-Options) a la línea `ExecStart` en el archivo de servicio de systemd en `/lib/systemd/system/jamulus-headless.service` (Por defecto estarás ejecutando un servidor privado).

source: Reload the systemd files `sudo systemctl daemon-reload` and restart the headless server: `sudo systemctl restart jamulus-headless`
es: Vuelve a cargar los archivos de sistemd `sudo systemctl daemon-reload` y reinicia el servidor "headless": `sudo systemctl restart jamulus-headless`

source: Check all is well with `service jamulus-headless status` (hit `q` to get back to the command prompt).
es: Comprueba que todo va bien con `service jamulus-headless status` (dale a `q` para volver a la línea de comandos).

source: ## Notes
es: ## Notas

source: You can control Jamulus with the `service` command. For example, to stop the server cleanly:
es: Puedes controlar Jamulus con el comando `service`. Por ejemplo, para detener el servidor limpiamente:

source: ### Viewing The Logs
es: ### Ver los Registros

source: Jamulus will log to the system file if you left the `StandardOutput=journal` setting in the unit file. Logging to the system log is recommended, as the system will manage the log file for you - no need to come back and purge it later or worry about filling up your disk space.
es: Jamulus dejará registros en el archivo del sistema si dejaste la configuración `StandardOutput=journal` en el archivo de unidad. Se recomienda dejar registros en el registro del sistema, ya que el sistema gestionará el archivo de registro por tí, sin necesidad de volver luego para purgarlo, o preocuparte por llenar espacio en el disco.

source: To view the log, use `journalctl` (to exit press Ctrl-C). For example, to read the system log file, filtered for the Jamulus service:
es: Para ver el registro, utiliza `journalctl` (para salir pulsa Ctrl-C). Por ejemplo, para leer el archivo de registro del sistema, filtrado para el servicio Jamulus:

source: For today’s entries:
es: Para los registros de hoy:

source: For the last hour:
es: Para la última hora:

source: Filter the log to see connection messages for your Jamulus server:
es: Filtrar el registro para ver mensajes de conexión de tu servidor Jamulus:

source: Follow (show on screen) Jamulus log messages as they occur:
es: Mostrar (en pantalla) mensajes de registro de Jamulus según ocurren:

source: ### Upgrading
es: ### Actualización

source: To upgrade your server to a newer version, simply download a new .deb and re-install as step 3.
es: Para actualizar tu servidor a una versión nueva, simplemente descarga el nuevo archivo .deb y reinstala como en el paso 3.

source: ### Recording
es: ### Grabación

source: See [this information](/wiki/Tips-Tricks-More#controlling-recordings-on-linux-headless-servers) on controlling recordings on headless servers.
es: Ver [esta información](/wiki/Tips-Tricks-More#controlar-grabaciones-en-servidores-linux-headless) sobre controlar las grabaciones en servidores "headless".
